Plan1x/Nixie-Clock/Firmware/Stm32/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Btn_Pin GPIO_PIN_5
#define Btn_GPIO_Port GPIOA
#define S2_Pin GPIO_PIN_6
#define S2_GPIO_Port GPIOA
#define S1_Pin GPIO_PIN_7
#define S1_GPIO_Port GPIOA
#define C_Pin GPIO_PIN_0
#define C_GPIO_Port GPIOB
#define B_Pin GPIO_PIN_1
#define B_GPIO_Port GPIOB
#define D_Pin GPIO_PIN_10
#define D_GPIO_Port GPIOB
#define A_Pin GPIO_PIN_11
#define A_GPIO_Port GPIOB
#define Red_indicator_Pin GPIO_PIN_13
#define Red_indicator_GPIO_Port GPIOB
#define Black_indicator_Pin GPIO_PIN_14
#define Black_indicator_GPIO_Port GPIOB
#define White_indicator_Pin GPIO_PIN_15
#define White_indicator_GPIO_Port GPIOB
#define Yellow_indicator_Pin GPIO_PIN_8
#define Yellow_indicator_GPIO_Port GPIOA
#define Green_indicator_Pin GPIO_PIN_9
#define Green_indicator_GPIO_Port GPIOA
#define Blue_indicator_Pin GPIO_PIN_10
#define Blue_indicator_GPIO_Port GPIOA
#define Led_4_Pin GPIO_PIN_15
#define Led_4_GPIO_Port GPIOA
#define Led_3_Pin GPIO_PIN_3
#define Led_3_GPIO_Port GPIOB
#define Led_2_Pin GPIO_PIN_4
#define Led_2_GPIO_Port GPIOB
#define Led_1_Pin GPIO_PIN_5
#define Led_1_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
